
*** Script.py

#+begin_src python :results output
  import pandas as pd
  from sklearn.datasets import load_breast_cancer
  from sklearn.model_selection import train_test_split
  from sklearn.linear_model import LogisticRegression
  from sklearn.model_selection import GridSearchCV

  # Load the dataset
  cancer = load_breast_cancer()

  # Split into training and testing data
  X_train, X_test, y_train, y_test = train_test_split(cancer.data, cancer.target)

  ## Initializing model and dictionary of hyperparameters
  lr = LogisticRegression(solver='liblinear', max_iter=1000)
  parameters = {'penalty':['l1', 'l2'], 'C':[1, 10, 100]}

  ## Setting up Grid Search
  clf = GridSearchCV(lr, parameters)

  ## Fit clf to training data and get best hyperparameters
  clf.fit(X_train, y_train)
  best_model = clf.best_estimator_

  print(best_model)
  print(clf.best_params_)

  ## Calculate training and test scores of the best estimator
  best_score = clf.best_score_
  test_score = clf.score(X_test, y_test)

  print(best_score)
  print(test_score)

  ## Viewing grid search results
  hyperparameter_grid = pd.DataFrame(clf.cv_results_['params'])
  grid_scores = pd.DataFrame(clf.cv_results_['mean_test_score'], columns = ['score'])

  best  df = pd.concat([hyperparameter_grid, grid_scores], axis=1)
  print(df)

#+end_src

#+RESULTS:
#+begin_example
LogisticRegression(C=10, max_iter=1000, penalty='l1', solver='liblinear')
{'C': 10, 'penalty': 'l1'}
0.9577291381668948
0.972027972027972
     C penalty     score
0    1      l1  0.946019
1    1      l2  0.946019
2   10      l1  0.957729
3   10      l2  0.950725
4  100      l1  0.957729
5  100      l2  0.953078
#+end_example

*** Script.py

#+begin_src python :results output
  import pandas as pd
  from sklearn.datasets import load_breast_cancer
  from sklearn.model_selection import train_test_split
  from sklearn.linear_model import LogisticRegression
  from sklearn.model_selection import RandomizedSearchCV
  from scipy.stats import uniform

  # Load the dataset
  cancer = load_breast_cancer()

  # Split the data into training and testing sets
  X = cancer.data
  y = cancer.target
  X_train, X_test, y_train, y_test = train_test_split(X, y)

  ## Create distributions to draw hyperparameters from
  distributions = {'penalty': ['l1', 'l2'], 'C': uniform(loc=0, scale=100)}

  ## Check Distributions
  first_draw = distributions['C'].rvs(10)
  second_draw = distributions['C'].rvs(10)
  print(first_draw, second_draw)

  ## Define model and initialize random search
  # The logistic regression model
  lr = LogisticRegression(solver = 'liblinear', max_iter = 1000)

  # Create a RandomizedSearchCV model
  clf = RandomizedSearchCV(lr, distributions, n_iter=8)

#+end_src

#+RESULTS:
: [ 0.95151198 18.17832879 98.29225059 98.63309585 64.87990249 54.72965383
:  79.61273531 97.34706443  1.81621269 14.69381351] [54.68761162 27.23025496  7.84063553 57.73277895 67.43024428 33.60107592
:   2.43227937 70.81002413 17.63107877 43.62842266]

*** Scritp.py

#+begin_src python :results output
  import pandas as pd
  from sklearn.datasets import load_breast_cancer
  from sklearn.model_selection import train_test_split
  from sklearn.linear_model import LogisticRegression
  from sklearn.model_selection import RandomizedSearchCV
  from scipy.stats import uniform

  # Load the dataset
  cancer = load_breast_cancer()

  # Split the data into training and testing sets
  X = cancer.data
  y = cancer.target
  X_train, X_test, y_train, y_test = train_test_split(X, y)

  # Create distributions to draw hyperparameters from
  distributions = {'penalty':['l1', 'l2'], 'C':uniform(loc=0, scale=100)}

  # The logistic regression model
  lr = LogisticRegression(solver='liblinear', max_iter=1000)

  # Create a RandomizedSearchCV model
  clf = RandomizedSearchCV(lr, distributions, n_iter=8)

  # Fit clf to training data and get best hyperparameters
  clf.fit(X_train, y_train)
  best_model = clf.best_estimator_

  print(best_model)
  print(clf.best_params_)

  # Calculate training and test scores of the best estimator
  best_score = clf.best_score_
  test_score = clf.score(X_test, y_test)

  print(best_score)
  print(test_score)

  # Viewing random search results
  hyperparameter_values = pd.DataFrame(clf.cv_results_['params'])
  randomsearch_scores = pd.DataFrame(clf.cv_results_['mean_test_score'], columns = ['score'])

  df = pd.concat([hyperparameter_values, randomsearch_scores], axis = 1)
  print(df)

#+end_src

#+RESULTS:
#+begin_example
LogisticRegression(C=45.50673040064779, max_iter=1000, penalty='l1',
                   solver='liblinear')
{'C': 45.50673040064779, 'penalty': 'l1'}
0.9671135430916553
0.958041958041958
           C penalty     score
0  36.879496      l2  0.962435
1  51.729072      l2  0.964761
2  99.524521      l2  0.960082
3  45.506730      l1  0.967114
4  24.166957      l2  0.964788
5  33.082236      l1  0.962408
6   0.493598      l2  0.960082
7  17.894889      l1  0.967114
#+end_example

